export const BOOKS = [
  {
    id: 1,
    title: "Война и мир",
    author: {
      id: 1,
      fullName: "Лев Николаевич Толстой"
    },
    description: "«Война и мир» — огромная сага, с равной глубиной рассказывающая о событиях различного масштаба: от частной жизни нескольких семей и конкретных сражений 1812 года до движения народов и истории вообще. Благодаря масштабу замысла, точности психологических наблюдений и жанровой универсальности эпопея Толстого остаётся в культурной памяти главным русским романом."
  },
  {
    id: 2,
    title: "Преступление и наказание",
    author: {
      id: 2,
      fullName: "Федор Михайлович Достоевский"
    },
    description: "Нищий и болезненно гордый студент Родион Романович Раскольников решает проверить, способен ли он на поступок, возвышающий его над «обычными» людьми. Для этого он убивает жалкую старую ростовщицу — а затем и её сестру, случайно оказавшуюся на месте преступления. Достоевский переиначивает детективный сюжет: имя убийцы и состав преступления известны с самого начала, а интригу составляет неотвратимое приближение наказания. Раскольников знакомится с проституткой Соней Мармеладовой, которая способствует его духовному перерождению, по пути к развязке спасает свою сестру от негодяя-жениха и вступает в психологическую дуэль со следователем Порфирием Петровичем. Остросюжетность Достоевский совмещает с предвещающими экзистенциализм философскими вопросами о свободе личности — и создаёт один из самых важных романов в истории литературы."
  },
  {
    id: 3,
    title: "Мастер и Маргарита",
    author: {
      id: 3,
      fullName: "Михаил Афанасьевич Булгаков"
    },
    description: "В Москву конца 1920-х, всё такую же разгульную и мещанскую, но уже советскую, прибывает таинственный иностранец, окружённый опереточной свитой. Он вовлекает оказавшихся на его пути москвичей в серию невообразимых происшествий, но его истинная миссия — найти опального автора романа о евангельской истории и влюблённую в него женщину. Булгаков начинает с традиционного для своего времени, почти фельетонного сюжета — о том, как застоявшийся советский быт взрывается вторжением чужака, вплетает в него историю последних дней Иисуса и приходит к очень личному трагическому повествованию о силе творчества, свойствах любви и переплетении добра и зла."
  },
  {
    id: 4,
    title: "Герой нашего времени",
    author: {
      id: 4,
      fullName: "Михаил Юрьевич Лермонтов"
    },
    description: "Об исключительном человеке, который страдает и приносит страдания другим. Лермонтовский Печорин, как сообщает авторское предисловие, — собирательный образ, «портрет, составленный из пороков всего нашего поколения, в полном их развитии». Несмотря на это — или благодаря этому, — Лермонтов сумел создать одного из самых живых и привлекательных героев в русской литературе: в глазах читателей его нарциссизм и любовь к манипулированию не затмевают ни глубокого ума, ни храбрости, ни сексуальности, ни честного самоанализа. В эпоху, уже почти расставшуюся с романтизмом, Лермонтов пишет «историю души» романтического героя и подбирает для его действий подходящих статистов и впечатляющие декорации."
  },
  {
    id: 5,
    title: "Анна Каренина",
    author: {
      id: 1,
      fullName: "Лев Николаевич Толстой"
    },
    description: "О нескольких семьях, счастливых одинаково и несчастных по-разному. О жизни в России 1870-х на разных её этажах — от петербургского высшего общества до крестьянских дворов. О светской женщине, которая бросает семью ради любви, ломая свою и чужие жизни, и о помещике-идеалисте, который ищет в семье любовь и правду. О явных и скрытых мотивах, которые движут людьми, о тайнах души и свойствах страсти."
  },
  {
    id: 6,
    title: "Мёртвые души",
    author: {
      id: 5,
      fullName: "Николай Васильевич Гоголь"
    },
    description: "В губернский город N. приезжает отставной чиновник Павел Иванович Чичиков, человек, лишённый отличительных черт и всем приходящийся по нраву. Очаровав губернатора, городских чиновников и окрестных помещиков, Чичиков начинает объезжать последних с загадочной целью: он скупает мёртвые души, то есть умерших недавно крепостных, которые ещё не внесены в ревизскую сказку ⁠ и потому формально считаются живыми. Навестив последовательно карикатурных, каждый в своём роде, Собакевича, Манилова, Плюшкина, Коробочку и Ноздрёва, Чичиков оформляет купчие и готовится довести до конца свой таинственный план, но к концу первого (и единственного завершённого) тома поэмы в городе N. сгущаются какие-то хтонические силы, разражается скандал, и Чичиков, по формулировке Набокова, «покидает город на крыльях одного из тех восхитительных лирических отступлений... которые писатель всякий раз размещает между деловыми встречами персонажа». Так заканчивается первый том поэмы, задуманной Гоголем в трёх частях; третий том так и не был написан, а второй Гоголь сжёг — сегодня нам доступны только его реконструкции по сохранившимся отрывкам, причём в разных редакциях, поэтому, говоря о «Мёртвых душах», мы подразумеваем в общем случае только первый их том, завершённый и опубликованный автором."
  },
  {
    id: 7,
    title: "Братья Карамазовы",
    author: {
      id: 2,
      fullName: "Федор Михайлович Достоевский"
    },
    description: "Последний роман Достоевского и завершающая часть пятикнижия ⁠ , где писатель намечает современному обществу выход из мировоззренческого тупика и полемизирует с явлениями, которые считает язвами своего века: атеизмом, материализмом, утилитарной социалистической моралью, разложением семьи. Теософский трактат в оболочке детективного романа об отцеубийстве, первоначально задуманный как первая часть «Жития великого грешника», через соблазны приходящего к праведности. Три брата — Дмитрий, Иван и Алексей Карамазовы — спорят о вечных вопросах (есть ли бессмертие души? Руководит ли человеком свободная воля или одни законы природы? Существует ли Бог и Творец?), параллельно разрешая любовные и денежные коллизии. Как писал Достоевский Николаю Любимову ⁠ , своему редактору в журнале «Русский вестник» ⁠ : «Если удастся, то сделаю дело хорошее: заставлю сознаться, что чистый, идеальный христианин — дело не отвлечённое, а образно реальное, возможное, воочию предстоящее и что христианство есть единственное убежище Русской Земли ото всех её зол»."
  },
];

export const AUTHORS = [
  {
    id: 1,
    fullName: "Лев Николаевич Толстой",
    firstName: "Лев",
    lastName: "Толстой",
    middleName: "Николаевич",
    dateOfBirth: "09 сентября 1828",
    dateOfDeath: "20 ноября 1910",
    bio: "Лев Толстой — один из самых известных писателей и философов в мире. Его взгляды и убеждения легли в основу целого религиозно-философского течения, которое называют толстовством. Литературное наследие писателя составило 90 томов художественных и публицистических произведений, дневниковых заметок и писем, а самого его не раз номинировали на Нобелевскую премию по литературе и Нобелевскую премию мира."
  },
  {
    id: 2,
    fullName: "Федор Михайлович Достоевский",
    firstName: "Федор",
    lastName: "Достоевский",
    middleName: "Михайлович",
    dateOfBirth: "11 ноября 1821",
    dateOfDeath: " 09 февраля 1881",
    bio: "Федор Достоевский с детства мечтал стать писателем. Первый же его роман «Бедные люди» высоко оценили Николай Некрасов и Виссарион Белинский, а четыре поздних произведения вошли в список «100 лучших книг всех времен». "
  },
  {
    id: 3,
    fullName: "Михаил Афанасьевич Булгаков",
    firstName: "Михаил",
    lastName: "Булгаков",
    middleName: "Афанасьевич",
    dateOfBirth: "15 мая 1891",
    dateOfDeath: "10 марта 1940",
    bio: "О своем творчестве Михаил Булгаков говорил так: «Черные и мистические краски, в которых изображены бесчисленные уродства нашего быта, яд, которым пропитан мой язык <…>, а самое главное — изображение страшных черт моего народа». При жизни писателя его пьесы запрещали к постановке, а повести и романы напечатали только в 1960-х. Сейчас же произведениями «Собачье сердце», «Белая гвардия», «Мастер и Маргарита» зачитываются со школы."
  },
  {
    id: 4,
    fullName: "Михаил Юрьевич Лермонтов",
    firstName: "Михаил",
    lastName: "Лермонтов",
    middleName: "Юрьевич",
    dateOfBirth: "15 октября 1814",
    dateOfDeath: "27 июля 1841",
    bio: "Михаил Лермонтов — один из самых известных русских поэтов, и признание к нему пришло еще при жизни. Его творчество, в котором сочетались острые социальные темы с философскими мотивами и личными переживаниями, оказало огромное влияние на поэтов и писателей XIX–XX веков. «Культура.РФ» рассказывает о личности, жизни и творчестве Михаила Лермонтова."
  },
  {
    id: 5,
    fullName: "Николай Васильевич Гоголь",
    firstName: "Николай",
    lastName: "Гоголь",
    middleName: "Васильевич",
    dateOfBirth: "01 апреля 1809",
    dateOfDeath: "04 марта 1852",
    bio: "Когда первую поэму Николая Гоголя раскритиковали современники, он выкупил и сжег весь тираж. Следующее произведение, «Вечера на хуторе близ Диканьки», сделало писателя знаменитым: историями о нечистой силе восхищались Александр Пушкин и Василий Жуковский. «Ревизор» и «Мертвые души», повести «Невский проспект» и «Шинель» — Гоголь высмеивал пороки и писал о «маленьком человеке». Литератор Сергей Аксаков говорил: «Это истинный мученик высокой мысли, мученик нашего времени»."
  },
  {
    id: 6,
    fullName: "Антон Павлович Чехов",
    firstName: "Антон",
    lastName: "Чехов",
    middleName: "Павлович",
    dateOfBirth: "29 января 1860",
    dateOfDeath: "15 июля 1904",
    bio: "Антон Чехов, писатель с образованием врача, создал более 300 произведений. В наши дни его пьесы ставят и экранизируют не только в России, но и за рубежом. В своих текстах Чехов поднимал самые разные темы, но вот о самом себе писать не любил. Как сказал он однажды: «у меня болезнь — автобиографофобия». "
  },
];

export const USERS = [
  {
    id: 1,
    username: "admin",
    sex: "male",
    email: "admin@cool-lib.org",
    info: "Админ всея сайта",
    phone: "+1234567890"
  },
  {
    id: 2,
    username: "user",
    sex: "male",
    email: "user@cool-lib.org",
    info: "Жалкий юзер ни на что не годный",
    phone: "+0987654321"
  },
];
